{"notes":["Compress assets","Social OG Images","accessibility","image alts","(Matt) add more images to Cancel-shaming Wall of Shame"],"aria-video":[{"id":"Vimeo Free","text":"Video showing Vimeo's sign up experience and where the \"free\" version is located—at the bottom of the page."},{"id":"Vimeo Explainer","text":"Video showing Vimeo's cancellation process. The user is required to turn-off \"auto-renew\" and then prompted again with a survey, which hides another button that officially cancels the subscription by clicking \"turn off auto-renew\" one more time."},{"id":"New York Times","text":"Video showing New York Times' website when navigating to canceling your subscription. The user must call their contact number."},{"id":"Savage Fenty 2","text":"Video showing Savage Fenty's website when going to manage your account. There is no cancellation screen—just a prompt to call or live chat with customer service if you have any \"questions.\""},{"id":"Boston Globe","text":"Video showing Boston Globe's website when going to cancel your account. It states that they only accept cancellations by phone."},{"id":"Vimeo","text":"Video showing Vimeo's website when going to cancel your account. It uses the term \"auto-renew\" rather than \"cancel.\""},{"id":"Express VPN","text":"Video showing Express VPN's website when going to cancel your account. It uses the term \"automatic renewal\" rather than \"cancel.\""},{"id":"Daily Harvest","text":"Video showing Daily Harvest's website when going to cancel your account. It uses the term \"pause plan\" and \"edit plan status\" rather than \"cancel.\""},{"id":"Savage Fenty","text":"Video showing Savage Fenty's website when making a purchase. When an item is added to cart, their VIP membership is automatically added, resulting in a recurring monthly subscription of $49.99 without making that purchase clear as a line-item cost."},{"id":"Amazon","text":"Video showing Amazon's website when making a purchase. When an item is added to cart, their subscription is added without making that purchase clear as a line-item cost."},{"id":"Care2Petition","text":"Video showing Care2Petition's website when going to unsubscribe. The user is directed to setup an account first."}],"companies":[{"id":"paramountplus","w":"250","h":"57","company":"Paramount Plus"},{"id":"deliveroo","w":"300","h":"101","company":"Deliveroo Silver plus"},{"id":"expressvpn","w":"247","h":"47","company":"Express VPN"},{"id":"amazon","w":"168","h":"65","company":"Amazon Subscribe and Save"},{"id":"google","w":"173","h":"59","company":"Google"},{"id":"ancestry","w":"284","h":"51","company":"Ancestry.com"},{"id":"vimeo","w":"153","h":"44","company":"Vimeo"},{"id":"netflix","w":"191","h":"58","company":"Netflix"},{"id":"hulu","w":"135","h":"44","company":"Hulu Disney Bundle"},{"id":"adobe","w":"222","h":"58","company":"Adobe"},{"id":"care2","w":"138","h":"58","company":"Care2Petition"},{"id":"dailyharvest","w":"211","h":"141","company":"Daily Harvest"},{"id":"savagefenty","w":"355","h":"42","company":"Savage Fenty"},{"id":"newyorktimes","w":"349","h":"47","company":"New York Times"},{"id":"bostonglobe","w":"328","h":"44","company":"Boston Globe"},{"id":"null","w":"100","h":"33","company":"null"}],"intro":[{"id":"first","text":"When you sign up for digital service, sometimes they make it difficult to unsubscribe.","type":"quote"},{"id":"third","text":"You see these tricks every time you order a product online, use a search engine, sign up for a streaming service, or join a social media community.","type":"quote"},{"id":"fourth","text":"They’re so common in subscription and shopping websites that they have a name: Dark Patterns.","type":"quote"}],"title":[{"id":"hed","text":"How Companies Make it Difficult to Break Up","alts":[{"type":"text","value":"* How companies make it difficult to unsubscribe"},{"type":"text","value":"* The Ways companies make it difficult to unsubscribe"},{"type":"text","value":"* Unsubscribing from online 15 services (and how it went)"}]},{"id":"dek","text":"Attempting to unsubscribe from 15 online services and documenting the ways companies made it, knowingly (or unknowingly), challenging.","alts":[{"type":"text","value":"* Attempting to unsubscribe from 15 online services and documenting every dark pattern that I encountered."},{"type":"text","value":"* Looking into difficult user experience design"}]},{"id":"byline","text":"by <a href=https://pudding.cool/author/caroline-sinders/>Caroline Sinders</a>, illustrations by <a href=https://pudding.cool/author/tynesha-foreman/>Tynesha Foreman</a>"},{"id":"first","type":"body","text":[{"type":"text","value":"Have you ever signed up for an email newsletter and decided to unsubscribe only to discover a few weeks later you’re still signed up? That’s a dark pattern."},{"type":"text","value":"Have you ever opened a website and been forced to agree to a series of pop-ups asking if you opt-in to ad tracking? That’s a cookie banner and they are riddled with dark patterns."},{"type":"text","value":"Or perhaps you’ve been shopping on a website with a countdown timer, reminding you a sale is about to end. Or maybe there’s a warning that the item is low in stock. Those are dark patterns."},{"type":"text","value":"Sometimes they are intentionally created by companies; other times it’s[a] an unintentional mistake by web designers. And dark patterns are not always easy to spot, regardless of your own understanding of technology: even experts regularly fall for dark patterns.<a target=_blank href=https://webtransparency.cs.princeton.edu/dark-patterns/>Princeton University ran a study in 2019</a> where they scanned over 11,000 shopping sites and found 1,818 examples of dark patterns on 11% of the websites. The research also found that “shopping websites that were more popular, according to Alexa rankings, were more likely to feature dark patterns.”"}]}],"experiment":[{"id":"body","type":"body","text":[{"type":"text","value":"I wanted to explore the malicious, confusing, and deceitful things that occur after signing up for digital services, as well as how design can nudge us to forget about a free trial or accidentally sign up for things that we didn’t intend to."},{"type":"text","value":"Dark patterns are often most egregious with subscriptions and free trials, especially when attempting to cancel, so I focused on those."}]},{"id":"body","type":"body","text":[{"type":"text","value":"I ran an experiment from August 2 to October 4, 2022, signing up for 16 different services and immediately tried to unsubscribe or cancel."}]},{"id":"graphic-company-slider","type":"graphic-company-slider"}],"happened":[{"id":"results","text":"The Results","type":"section-head"},{"id":"body","type":"body","text":[{"type":"text","value":"I recorded all the different kinds of problems that occurred, and all the websites engaged in bad or confusing tactics at some point, even after successfully unsubscribing."},{"type":"text","value":"I found 20 instances of dark patterns across all 16 companies—let’s take a look at the major types."}]}],"darkTypes":[{"id":"dark-first","type":"darkStep","options":"Savage Fenty,Amazon","hed":"Purchasing That Creates an Automatic Subscription","text":[{"type":"text","value":"Some of the websites I encountered created automatic subscriptions to their sites, just by me placing an item in a basket and checking out. This is a kind of dark patterns practice also documented by Princeton University in their research."}]},{"id":"dark-second","type":"darkStep","options":"Care2Petition","hed":"Having to Create an Account to Email Unsubscribe","text":[{"type":"text","value":"Care2Petition didn’t require me signing up with the platform to use it to sign different petitions but it clearly saved all of my information to send me lots of emails. However, the only way to stop the emails was to then sign up with a profile for Care2Petition to then cancel the subscriptions to stop receiving emails."}]},{"id":"dark-third","type":"darkStep","options":"Daily Harvest,Express VPN,Vimeo","hed":"Products that confusingly label “Cancel” or “Unsubscribe”","text":[{"type":"text","value":"Some websites that are subscription-based hide the cancellation flow under a new name: “auto-renew” or “edit plan.” With Daily Harvest, Express VPN and Vimeo, there isn’t a button or area that says “cancel.” Instead a user has to look for “auto-renew” and turn off “auto-renew” payments, which effectively cancels the subscription. This kind of naming is confusing, adding unnecessary friction to the cancellation process."}]},{"id":"dark-fourth","type":"darkStep","options":"New York Times,Savage Fenty 2,Boston Globe","hed":"Phone call to cancel (or sometimes, chat with a person or bot to cancel)","text":[{"type":"text","value":"This kind of cancellation process, also labeled a dark pattern by Princeton University and the FTC, creates a more difficult and longer process to cancel as a user has to call or text chat with a customer service representative to initiate the cancellation process. As we discovered, in some cases, it can take over 15 minutes to create a cancellation, or having to place multiple phone calls to start the cancellation process."}]},{"id":"dark-fifth","type":"darkStep","options":"Netflix,Hulu,Paramount Plus","hed":"Keeping Your Email Post Cancellation to Send Spam and Ads","text":[{"type":"text","value":"Netflix, Hulu, and Paramount Plus all sent emails to my account after canceling, spamming and pleading to return. While this isn’t technically a dark pattern, it potentially violates data protection laws in other countries, and it’s just a bad and invasive practice. Once a user has canceled a subscription, <a href=https://medium.com/@the_manifest/9-tips-for-compelling-email-unsubscribe-pages-e2e8cae01c8f>experts suggest to not keep emailing them</a>."}]}],"vimeo":[{"id":"vimeo_1","text":"However, the most egregious one: Vimeo.","type":"quote","body":[{"type":"text","value":"<span class=big>However, the most egregious one: Vimeo.</span>"},{"type":"text","value":"What makes Vimeo the most egregious is both the amount of dark patterns and the kinds of dark patterns. Vimeo presents its default subscription as a month-to-month payment, but it actually locks consumers into a yearlong, non-refundable subscription. The <b>actual</b> month-to-month plan is buried in the design <span class=dropImage></span>."},{"type":"text","value":"Harry Brignull’s <a href=https://twitter.com/darkpatterns>Deceptive Design</a> twitter account about dark patterns found something similar <a target=_blank href=https://twitter.com/darkpatterns/status/1489901640777973768>that Adobe had done</a> in February 2022, which the company has removed. In February 2022, internet users noticed that Adobe had tricked users into a similar yearlong contract, but would offer only refunds of 3-6 months. Adobe, like Vimeo, misled users into signing up for yearlong contracts."}]},{"id":"vimeo_2","type":"body","text":"“...”","body":[{"type":"text","value":"Vimeo went even further by adding numerous steps to unsubscribe."},{"type":"text","value":"The unsubscribe button is unintuitively buried within the “billing” section (rather than “manage subscription”). To cancel, you confusingly click “turn off auto-renew,” rather than the obvious “cancel subscription.”"},{"type":"text","value":"The cancellation process concludes with a survey, where you again have to click, “turn off auto-renew.” Surveys often come <b>after</b> the cancellation process; users could think, “Oh I've canceled!” but they still have to click “turn off auto-renew” again."}]},{"id":"vimeo_3","type":"body","text":"“...”","body":[{"type":"text","value":"Part of the issues with dark patterns is this gray area of “clarity.” After rooting around for it, I did find fine print for Vimeo’s year long subscription dark pattern. Yet so much of the sign up experience had pre-selected the yearlong “subscription.” Casual users would have had to really read carefully to know what they were signing up for and spend the extra effort to unselect those pre-selected choices."},{"type":"text","value":"Compare my experience with Vimeo to the 14 other services that I tested; only Vimeo locked me into a yearlong contract (Ancestry.com has a similar yearlong contract, but it wasn’t guiding users to a pre-selected, yearlong subscription)."},{"type":"text","value":"Additionally, Vimeo <a target=_blank href=https://points.datasociety.net/dark-patterns-and-design-policy-75d1a71fbda5>hides its free account,</a> a design choice that has remained since at least 2020. Collectively, these multiple dark patterns make Vimeo an egregious actor in this experiment."}]}],"results":[{"id":"first","type":"body","text":[{"type":"text","value":"<span class=big>In total, I lost: $330.60 and 57 minutes and 31 seconds trying to unsubscribe.</span>"},{"type":"text","value":"Every website resulted in lost money but the only one that refunded me was Adobe. None of the websites reminded you prior to the trial being over that the trial would be over. Even ones that said they would, like Deliveroo Silver, did not."},{"type":"text","value":"The websites that took the longest to cancel subscriptions were the ones that required phone calls: the New York Times took 17 minutes and 36 seconds to cancel, and the Boston Globe took 3 phone calls (which was undergoing technical difficulties in order to cancel, hence the three phone calls). Savage Fenty required either a phone call or taking a person via a chat interface online, which took 7 minutes."}]},{"id":"second","type":"body","text":[{"type":"text","value":"Canceling via the website was not necessarily faster. Netflix, Hulu and Paramount Plus had no dark patterns and a straightforward way to cancel, which took under 1 minute."},{"type":"text","value":"Once I googled ‘how to cancel’ ExpressVPN (which is itself a dark pattern), it took 55 seconds. The ExpressVPN process was riddled with dark patterns: the canceling process was called ‘auto-renew’ and there wasn’t any documentation in their FAQ on how to cancel. By having to Google on how to cancel, that itself, is also a dark pattern."}]},{"id":"third","type":"body","text":[{"type":"text","value":"<span class=big>I also encountered a lot of friction when trying to cancel.</span>"},{"type":"text","value":"Nearly all had confirm-shaming (please stay! Are you sure you want to leave?) and some, like Paramount +, Adobe, offered discounts and deals instead of canceling."},{"type":"text","value":"Some cancellation processes took multiple steps, such as confirming multiple times that I wanted to cancel. Some buried their cancellation processes deep in their websites that were difficult to find. A few, like ExpressVPN, Daily Harvest and Vimeo, called their cancellation processes ‘auto-renew’, adding to confusion."}]},{"id":"fourth","type":"body","text":[{"type":"text","value":"<span class=big>What are the Issues with Dark Patterns, Really?</span>"},{"type":"text","value":"Dr. Jennifer King, a fellow with Stanford University focusing on dark patterns and privacy, described the multiple issues with dark patterns around contracts and subscriptions. For example, why in certain products is it so much more difficult to unsubscribe than to subscribe? Should these subscribe and unsubscribe flows be similar?"},{"type":"text","value":"“The key concept that I keep seeing discussed is proportionality; it shouldn't be disproportionately harder to cancel, as opposed to signing up for something,” said Dr. King, in response to my experience with Vimeo. It’s not that difficult for a company to absolve a contract, something Dr. King mentioned as well. She explained, “[Companies are] not bearing any costs by you canceling other than depriving them of that revenue.” This kind of proportionality between subscribing and unsubscribing is something <a target=_blank href=https://www.ftc.gov/news-events/news/press-releases/2023/03/federal-trade-commission-proposes-rule-provision-making-it-easier-consumers-click-cancel-recurring>the FTC is actively looking into and proposing new rules around to make it easier to end subscriptions</a>."},{"type":"text","value":"King pointed out that the part of the issue is companies framing this as a subscription, when it’s actually closer to a contract. King said, “ The fact that you're on the hook for the whole year just because you didn't hit the cancel button in time to end a free trial.”"},{"type":"text","value":"Dark patterns, manipulative design, and confusing design have a multiplicity of harms, including impacting consumers decision making and behaviors, along with affecting competition and markets.  Over a video conference call, Andreas Jespersen, the Interim Director for the CMA’s Behavioral Hub, unpacked why this is a concern for the CMA. <span class=pull>“Our worry is that if you're a large, firm, and you own many sort of different and interconnected types of businesses, so if you own both a in a browser and a phone for instance, or you own a, you develop computers and games… we think you can use choice architecture to guide consumers from one part of your product to product the most interesting and then to other parts of product giving subsets of your business an unfair advantage over competitors who don't have that initial ability to guide consumers by having owning the device or owning the platform or whatever,” he explained.</span>"},{"type":"text","value":"It has to be looked at in terms of understanding fairness, advantages and disadvantages, along with unfair price advantages that can harm a lot of consumers and affect pricing. “From the viewpoint of the individual consumer, the largest problem with choice architecture or dark patterns is basically its ability to stop or unduly influence your decisions when you're online. We know from research that these types of dark patterns such as architecture can make you buy stuff at a high price. They can keep you on for longer than you wanted in a subscription; they can make you give up more data than you initially wanted. And all of these effects are basically even if the magnitude of the harm is enormous, in combination, and with the presence of many of these practices online there, is there a substantial risk of sort of consumer detriment if we are continuously exposed to these things? Obviously,” Jepsersen stated."},{"type":"text","value":"At present, the CMA has done a variety of studies and use cases, including two that are focused on subscriptions. They worked with PlayStation and found that it was difficult for consumers to understand what they signed up for and consumers felt they'd stayed on longer than they wanted to. Jepsersen explained how the CMA worked with the company to reach an agreement that they would change their security practices to sort of better accommodate the choice architecture to how the consumers naturally interacted with the subscriptions."},{"type":"text","value":"But, also importantly, I would argue that user frustration, wasted time and money are pretty big harms. University of Washington Law professor Ryan Calo has argued that dark patterns <a target=_blank href=http://www.gwlr.org/wp-content/uploads/2014/10/Calo_82_41.pdf>can result in three kinds of harm typologies</a>: economic harm, privacy harm and vulnerability as autonomy harm. Similarly, the same <a target=_blank href=https://arxiv.org/pdf/2101.04843.pdf>authors behind the Princeton E-commerce study,</a> found similar harms but with cognitive burden instead of vulnerability as autonomy."},{"type":"text","value":"What’s important to remember, and consider, with dark patterns, is not to view this as an individualistic threat, but one against large group —of people. It doesn’t matter if you personally were not tricked or weren’t mad at the interaction but it matters that the interaction themselves are happening, and that they are designed to target users, corporate our user agency, and impact our choices. It also matters how prevalent dark patterns are, too. A <a target=_blank href=https://op.europa.eu/en/publication-detail/-/publication/606365bc-d58b-11ec-a95f-01aa75ed71a1/language-en/format-PDF/source-257599418>European Union commissioned report on dark patterns</a> found “97% of the most popular websites and apps used by EU consumers deployed at least one dark pattern. Dark patterns don’t have to be a norm of the web, even if they have become so prevalent right now."},{"type":"text","value":"Dark patterns don’t affect all users equally- users that speak different languages, or are in a foreign country, or are new to technology, are disproportionately affected by dark patterns. That same European Union report found that “vulnerable consumers were more likely to make inconsistent choices (50.89%) than average consumers (47.24%) when exposed to dark patterns. Their report and experiment tested 7,000 European Union based netizens across different language blocs. Equally important, their found dark patterns are easier to spot if you know what they are or have a background in user experience design. A person shouldn’t have to be a UX designer to navigate the web just to avoid dark patterns, confusion and manipulation. That isn’t a fair web."},{"type":"text","value":"<span class=big>Easy To Unsubscribe as Subscribe</span>"},{"type":"text","value":"Across conversations with different experts, researchers and regulators, this is a refrain I hear again and again, given how low the barrier is to engage with something, it should be equally low to nullify that dark pattern. This is something researchers against dark patterns advocate for, with Access Now and the Web Foundation’s forthcoming ‘Dos and Dont’s of Deceptive Design,’ along with dark patterns experts like Jen King, mentioned above. It should be easy to unsubscribe as it is to subscribe, something <a target=_blank href=https://www.ftc.gov/news-events/news/press-releases/2021/10/ftc-ramp-enforcement-against-illegal-dark-patterns-trick-or-trap-consumers-subscriptions>the FTC is focusing on in terms</a> of their own dark patterns work and investigations. Shopify has even published an article on <a target=_blank href=https://www.shopify.com/partners/blog/dark-patterns>12 Dark Patterns to avoid</a> for product designers, with nearly identical advice to don’t do this, except they call this practice the ‘roach motel.’"},{"type":"text","value":"<span class=big>Dark Patterns Regulation Exists and More is Coming </span>"},{"type":"text","value":"What can be done about dark patterns? We are entering an era of dark patterns related to regulation, and investigation."},{"type":"text","value":"In the EU, regulators like the <a target=_blank href=https://www.forbrukerradet.no/dark-patterns/>Norwegian Consumer Council</a> have been focusing on dark patterns and their harms since 2018, along with regulation like the <a target=_blank href=https://techpolicy.press/do-the-dsa-and-dma-have-what-it-takes-to-take-on-dark-patterns/>EU’s Digital Markets Act with two articles focused on dark patterns and the Digital Services Act mentioning dark patterns in their provisional text</a>. Different regulators found various dark patterns in the EU’s GDPR to be against the law itself, violating user consent and co-opting user privacy, resulting in fines. Other regulators, like the <a target=_blank href=https://www.gov.uk/government/publications/online-choice-architecture-how-digital-design-can-harm-competition-and-consumers>UK’s Competitions and Markets Authority</a> are investigating dark patterns to see if these design based confusion and manipulative patterns affect fair competition. Jespersen emphasized, “[the CMA] wants to use the full extent of our powers to go through consumer enforcement if we find appropriate problems.”"},{"type":"text","value":"Even in the US, dark patterns related regulation is ramping up, with <a target=_blank href=https://www.ftc.gov/news-events/news/press-releases/2021/10/ftc-ramp-enforcement-against-illegal-dark-patterns-trick-or-trap-consumers-subscriptions>the FTC vowing to ramp up enforcement on dark patterns that trick or trap users into subscriptions</a> in 2021, and <a target=_blank href=https://www.niemanlab.org/2018/07/thanks-to-california-a-news-site-or-other-business-now-has-to-let-you-cancel-your-subscription-online/>California’s state law in 2018</a> mentioning dark patterns. <a target=_blank href=https://www.ftc.gov/news-events/news/press-releases/2022/11/ftc-action-against-vonage-results-100-million-customers-trapped-illegal-dark-patterns-junk-fees-when-trying-cancel-service>In early November, the FTC fined phone service provider Vonage $100 million dollars for cancellation based dark patterns</a>. Vonage’s dark patterns were identical to some of the dark patterns I found for this article.  Via a court order, the FTC’s <a target=_blank href=https://www.ftc.gov/news-events/news/press-releases/2022/11/ftc-action-against-vonage-results-100-million-customers-trapped-illegal-dark-patterns-junk-fees-when-trying-cancel-service>has gotten Vonage to agree to simplify their cancellation process and to explicitly stop using dark patterns.</a>"},{"type":"text","value":"With this recent Vonage case, it’s clear the tide is changing. A user should not have to be a design expert to buy a <a target=_blank href=https://www.deceptive.design/types/hidden-costs>fair priced item or avoid hidden fees</a>, <a target=_blank href=https://www.deceptive.design/types/roach-motel>accidental subscriptions</a>, or <a target=_blank href=https://www.deceptive.design/types/privacy-zuckering>give up more of their data</a> without their choice. Difficult to find or access privacy settings on social networks is problematic, so is waiting 20 minutes to cancel a newspaper subscription and so additional fees from airlines that ultimately misrepresent the price. It might be personal what you or your community considers more problematic or harmful, but all dark patterns are problematic."},{"type":"text","value":"To put this into context, what if every experiment of mine had resulted in 15 minutes of headache to unsubscribe, along with secret or hidden fees of hundreds of dollars of yearly subscriptions instead of monthly ones? 14 experiments would have resulted in over three and half hours of attempting to cancel, and double or triple the amount of money I lost.[b][c]"},{"type":"text","value":"This is also something King echoed, “You have as a consumer, the right to cancel something, to not want to spend your money in a particular way and to act somehow, just because they can control the entire kind of digital environment in which you're doing business that you don't somehow have those rights is is just fundamentally wrong.”"},{"type":"text","value":"It's the trickery and subterfuge of dark patterns that make them feel emotionally insidious. But regardless, economic harm, privacy harm, one’s vulnerability being targeted and manipulated along with the cognitive burden of navigating dark patterns, is what makes dark patterns writ large such an urgent issue. Outside of the U.S., these kinds of harms are seen as urgent legal issues, where European consumers have a right to data protection and consumer protection. But, all people, regardless of which country they live in, deserve to live on an internet where their time and money are not wasted, and their privacy is not compromised simply because a product or company can trick them.[d][e]"}]}],"a":[],"b":[],"c":[],"d":[],"e":[]}