{"intro":[{"id":"first","type":"body","text":[{"type":"text","value":"Have you ever…"},{"type":"text","value":"Ordered a product online"},{"type":"text","value":"Used a search engine"},{"type":"text","value":"Signed up for a streaming service"},{"type":"text","value":"Joined a video sharing site"},{"type":"text","value":"Signed up for a digital news subscription"}]},{"id":"second","type":"body","text":[{"type":"text","value":"Have you ever used:"},{"type":"text","value":"Amazon"},{"type":"text","value":"Google"},{"type":"text","value":"Ancestry.com"},{"type":"text","value":"Vimeo"},{"type":"text","value":"Paramount"},{"type":"text","value":"Netflix"},{"type":"text","value":"Hulu"},{"type":"text","value":"Adobe"},{"type":"text","value":"Savage Fenty"},{"type":"text","value":"New Yorktimes.com"},{"type":"text","value":"BostonGlobe.com"},{"type":"text","value":"Daily Harvest"},{"type":"text","value":"Deliveroo"},{"type":"text","value":"Care2Petition"},{"type":"text","value":"Express VPN"}]}],"title":[{"id":"top","text":"Title"},{"id":"bottom","text":"description"},{"id":"byline","text":"by Caroline Sinders, illustrations by Tynesha Foreman"}],"whatIs":[{"id":"first","type":"body","text":[{"type":"text","value":"What is a dark pattern? Dark patterns are design patterns that unintentionally or intentionally trick people into making decisions they normally wouldn’t make. Have you ever signed up for an email listserve and decided to unsubscribe only to discover days later you’re still signed up? That’s a dark pattern. Have you ever opened an online news site in the EU and seen a series of pop ups asking if you agree or not? That’s the GDPR and it was riddled with dark patterns. Or perhaps you’ve been shopping on a website, and seen a countdown timer reminding you a sale is about to end, or seen a little ticker above the item you’re clicking on that it’s low in stock? All of those, depending upon how they’re shown to you, are dark patterns."},{"type":"text","value":"Dark patterns can be easy, and difficult to spot, regardless of your own technical prowess. The editors, writers, designers and technologists working on this article have all fallen for dark patterns, and we even study them. <a href=https://webtransparency.cs.princeton.edu/dark-patterns/>Princeton University ran a study in 2019</a> where they crawled over 11,000 e-commerce and shopping sites and found 1,818 dark patterns. Those 1,818 were present on 1,254 of the 11,00 shopping websites, which is about 11.1% of sites they looked at. The research also found that “shopping websites that were more popular, according to Alexa rankings, were more likely to feature dark patterns.”"}]}],"experiment":[{"id":"subhead","type":"subhead","text":"Our Experiment"},{"id":"body","type":"body","text":[{"type":"text","value":"This article focuses on the dark patterns that occur from a common place in consumers’ lives: signing up for a service or a product, and then deciding to cancel. Canceling subscriptions or products, or accidentally being signed up for a subscription without realizing it, or forgetting about a free trial that then turns into a paid trial, is a really common occurrence across digital products. Not all of those experiences have dark patterns, but a lot do. I decided to explore how easy it was to sign up for a service, and see what kinds of malicious, confusing or deceitful behaviors occurred afterwards."},{"type":"text","value":"From August 2 to October 4, 2022, I signed up for 16 different websites or products and started to map out what problems occurred, like: encountering dark patterns or frictions from canceling, which websites reminded me (or didn’t) when a free trial lapsed, if I could get refunded from a subscription, and then mapping out how much time and money I lost trying to unsubscribe from those products, services or systems. I purposefully selected well-known and common websites or websites that had been identified by experts as having ‘dark patterns.’"},{"type":"text","value":"I analyzed:"},{"type":"text","value":"Amazon Subscribe and Save"},{"type":"text","value":"Ancestry.com"},{"type":"text","value":"Vimeo"},{"type":"text","value":"Paramount"},{"type":"text","value":"Netflix"},{"type":"text","value":"Hulu"},{"type":"text","value":"Adobe"},{"type":"text","value":"Savage Fenty"},{"type":"text","value":"New York Times.com"},{"type":"text","value":"BostonGlobe.com"},{"type":"text","value":"Daily Harvest"},{"type":"text","value":"Deliveroo"},{"type":"text","value":"Care2Petition"},{"type":"text","value":"Express VPN"}]}],"results":[{"id":"first","type":"body","text":[{"type":"text","value":"In total, I lost: $330.60 and 57 minutes and 31 seconds trying to unsubscribe."},{"type":"text","value":"Across, the 16 websites, I encountered 20 instances dark patterns. But all of the websites engaged in bad or confusing tactics at some point, even after successfully un-subscribing."},{"type":"text","value":"Every website resulted in lost money but the only one that refunded me was Adobe, from a lack of reminders of when free trials ended, to being locked into longer, annual subscriptions, adding extra steps for confirmation (where it felt like we had unsubscribed but there was one more click to actually confirm) or hiding when a trial exactly ended."}]}]}